TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/m0p/mspm0g518x.h
typedef struct {
    UNICOMM_Regs     * const inst;
    UNICOMMUART_Regs * const uart;
    UNICOMMI2CC_Regs * const i2cc;
    UNICOMMI2CT_Regs * const i2ct;
    UNICOMMSPI_Regs  * const spi;
    bool               const fixedMode;
} UNICOMM_Inst_Regs;

static const UNICOMM_Inst_Regs UC0_Inst = {
    .inst = ((UNICOMM_Regs *) UC0_BASE),
    .uart = ((UNICOMMUART_Regs *) UC_UART_BASE(UC0_BASE)),
    .i2cc = ((UNICOMMI2CC_Regs *) UC_I2CC_BASE(UC0_BASE)),
    .i2ct = ((UNICOMMI2CT_Regs *) UC_I2CT_BASE(UC0_BASE)),
    .fixedMode = false,
};

static const UNICOMM_Inst_Regs UC1_Inst = {
    .inst = ((UNICOMM_Regs *) UC1_BASE),
    .uart = ((UNICOMMUART_Regs *) UC_UART_BASE(UC1_BASE)),
    .i2cc = ((UNICOMMI2CC_Regs *) UC_I2CC_BASE(UC1_BASE)),
    .i2ct = ((UNICOMMI2CT_Regs *) UC_I2CT_BASE(UC1_BASE)),
    .fixedMode = false,
};

static const UNICOMM_Inst_Regs UC2_Inst = {
    .inst = ((UNICOMM_Regs *) UC2_BASE),
    .spi = ((UNICOMMSPI_Regs *) UC_SPI_BASE(UC2_BASE)),
    .fixedMode = true,
};

static const UNICOMM_Inst_Regs UC3_Inst = {
    .inst = ((UNICOMM_Regs *) UC3_BASE),
    .uart = ((UNICOMMUART_Regs *) UC_UART_BASE(UC3_BASE)),
    .spi = ((UNICOMMSPI_Regs *) UC_SPI_BASE(UC3_BASE)),
    .fixedMode = false,
};

/*@}*/ /* end of group MSPM0G518X_MemoryMap */

/******************************************************************************
* Peripheral declarations                                                     *
******************************************************************************/
/** @addtogroup MSPM0G518X_PeripheralDecl MSPM0G518X Peripheral Declaration
  @{
*/

static LFSS_Regs                                * const LFSS                           = ((LFSS_Regs *) LFSS_BASE);
static RTC_Regs                                 * const RTC_B                          = ((RTC_Regs *) RTC_B_BASE);
static DEBUGSS_Regs                             * const DEBUGSS                        = ((DEBUGSS_Regs *) DEBUGSS_BASE);
static KEYSTORECTL_Regs                         * const KEYSTORECTL                    = ((KEYSTORECTL_Regs *) KEYSTORECTL_BASE);
static AESADV_Regs                              * const AESADV                         = ((AESADV_Regs *) AESADV_BASE);
static WWDT_Regs                                * const WWDT0                          = ((WWDT_Regs *) WWDT0_BASE);
static GPTIMER_Regs                             * const TIMG0                          = ((GPTIMER_Regs *) TIMG0_BASE);
static CRCP_Regs                                * const CRCP0                          = ((CRCP_Regs *) CRCP0_BASE);
static VREF_Regs                                * const VREF                           = ((VREF_Regs *) VREF_BASE);
static COMP_Regs                                * const COMP0                          = ((COMP_Regs *) COMP0_BASE);
static GPIO_Regs                                * const GPIOA                          = ((GPIO_Regs *) GPIOA_BASE);
static WWDT_Regs                                * const WWDT1                          = ((WWDT_Regs *) WWDT1_BASE);
static GPIO_Regs                                * const GPIOB                          = ((GPIO_Regs *) GPIOB_BASE);
static CPUSS_Regs                               * const CPUSS                          = ((CPUSS_Regs *) CPUSS_BASE);
static IOMUX_Regs                               * const IOMUX                          = ((IOMUX_Regs *) IOMUX_BASE);
static GPTIMER_Regs                             * const TIMA0                          = ((GPTIMER_Regs *) TIMA0_BASE);
static GPTIMER_Regs                             * const TIMG6                          = ((GPTIMER_Regs *) TIMG6_BASE);
static GPTIMER_Regs                             * const TIMG7                          = ((GPTIMER_Regs *) TIMG7_BASE);
static DMA_Regs                                 * const DMA                            = ((DMA_Regs *) DMA_BASE);
static SYSCTL_Regs                              * const SYSCTL                         = ((SYSCTL_Regs *) SYSCTL_BASE);
static WUC_Regs                                 * const WUC                            = ((WUC_Regs *) WUC_BASE);
static FLASHCTL_Regs                            * const FLASHCTL                       = ((FLASHCTL_Regs *) FLASHCTL_BASE);
static I2S_Regs                                 * const I2S0                           = ((I2S_Regs *) I2S0_BASE);
static NPU_Regs                                 * const NPU                            = ((NPU_Regs *) NPU_BASE);
static FACTORYREGION_OPEN_Regs                  * const FACTORYREGION                  = ((FACTORYREGION_OPEN_Regs *) FACTORYREGION_BASE);
static BTIMER_Regs                              * const TIMB0                          = ((BTIMER_Regs *) TIMB0_BASE);
static USB_Regs                                 * const USBFS0                         = ((USB_Regs *) USBFS0_BASE);
static SPGSS_Regs                               * const SPG1                           = ((SPGSS_Regs *) SPG1_BASE);
static ADC12_Regs                               * const ADC0                           = ((ADC12_Regs *) ADC0_BASE);
static ADC12_PERIPHERALREGIONSVT_Regs           * const ADC0_SVT                       = ((ADC12_PERIPHERALREGIONSVT_Regs *) ADC0_SVT_BASE);
static SPGSS_Regs                               * const SPG0                           = ((SPGSS_Regs *) SPG0_BASE);

static UNICOMM_Inst_Regs                        * const UC0                            = (UNICOMM_Inst_Regs *) &UC0_Inst;
static UNICOMM_Inst_Regs                        * const UC1                            = (UNICOMM_Inst_Regs *) &UC1_Inst;
static UNICOMM_Inst_Regs                        * const UC2                            = (UNICOMM_Inst_Regs *) &UC2_Inst;
static UNICOMM_Inst_Regs                        * const UC3                            = (UNICOMM_Inst_Regs *) &UC3_Inst;

/******************************************************************************
* SYS parameters                                                              *
******************************************************************************/

#define ADC0_SYS_NUM_ANALOG_CHAN                      (16)      /* !< Number of analog channels. */
#define BTIM_SYS_NUM_COUNTERS                         (4)       /* !< Max number of counters. */
#define CRCP0_SYS_CRC32_ENABLE                        (1)       /* !< Parameter to exclude or include 32-bit CRC. This is added for
                                                      Lego_N1 products where 32-bit CRC can be excluded in order to save
                                                      gates. */
#define DMA_SYS_N_DMA_CHANNEL                         (12)      /* !< Number of DMA channels implemented in DMA. */
#define DMA_SYS_N_DMA_FULL_CHANNEL                    (6)       /* !< Number of FULL-DMA channels implemented in DMA. If
                                                      SYS_N_DMA_CHANNEL is larger than SYS_N_DMA_FULL_CHANNEL, the
                                                      remaining channel will be BASIC channel with limited functionality. */
#define DMA_SYS_MMR_AUTO                              (1)       /* !< Boolean for if auto enable channels implemented in DMA. */
#define DMA_SYS_MMR_EM                                (1)       /* !< Boolean for if extended mode channels implemented in DMA. */
#define DMA_SYS_MMR_LLONG                             (1)       /* !< Boolean for if channels implemented in DMA with 128-bit access. */
#define DMA_SYS_MMR_STRIDE                            (1)       /* !< Boolean for if channels implemented in DMA with stride mode. */
#define FLASHCTL_SYS_DATAWIDTH                        (128)     /* !< Data bit width of a single flash word:    Minimum: 64    Maximum:
                                                      128 */
#define FLASHCTL_SYS_WEPROTBWIDTH                     (16)      /* !< Bit width of WEPROTB register. */
#define FLASHCTL_SYS_WEPROTAWIDTH                     (0)       /* !< Bit width of WEPROTA register. */
#define FLASHCTL_SYS_WEPROTCWIDTH                     (0)       /* !< Bit width of WEPROTC register. */
#define I2S0_SYS_FENTRIES                             (4)       /* !< Number of FIFO entries */
#define I2S0_SYS_SINGLE_PIN                           (0)       /* !< Boolean for if enable single Data Pin configuration. */
#define SPI0_SYS_FENTRIES                             (4)       /* !< The number of entries in RX and TX FIFO */
#define SPI1_SYS_FENTRIES                             (4)       /* !< The number of entries in RX and TX FIFO */
#define SPG0_SYS_FENTRIES                             (4)       /* !< The number of entries in RX and TX FIFO */
#define COMP_SYS_DACOUT_EN                            (1)       /* !< Boolean for if 8-bit DAC output to pin is available */

