TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/m0p/mspm0g518x.h
/* IOMUX_PINCM14[PF] Bits */
#define IOMUX_PINCM14_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM14_PF_GPIOA_DIO07                  ((uint32_t)0X00000001)
#define IOMUX_PINCM14_PF_UC2_POCI                     ((uint32_t)0X00000002)
#define IOMUX_PINCM14_PF_UC2_CS2                      ((uint32_t)0X00000003)
#define IOMUX_PINCM14_PF_COMP0_OUT                    ((uint32_t)0X00000004)
#define IOMUX_PINCM14_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM14_PF_TIMG7_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM14_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000007)
#define IOMUX_PINCM14_PF_TIMA0_CCP1                   ((uint32_t)0X00000008)
#define IOMUX_PINCM14_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000009)

/* IOMUX_PINCM15[PF] Bits */
#define IOMUX_PINCM15_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM15_PF_GPIOB_DIO02                  ((uint32_t)0X00000001)
#define IOMUX_PINCM15_PF_UC3_PICO                     ((uint32_t)0X00000002)
#define IOMUX_PINCM15_PF_UC3_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM15_PF_UC1_SCL                      ((uint32_t)0X00000003)
#define IOMUX_PINCM15_PF_UC1_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM15_PF_UC1_CTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM15_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM15_PF_TIMG6_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM15_PF_UC2_PICO                     ((uint32_t)0X00000007)
#define IOMUX_PINCM15_PF_SYSCTL_HFCLKIN               ((uint32_t)0X00000008)

/* IOMUX_PINCM16[PF] Bits */
#define IOMUX_PINCM16_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM16_PF_GPIOB_DIO03                  ((uint32_t)0X00000001)
#define IOMUX_PINCM16_PF_UC3_SCLK                     ((uint32_t)0X00000002)
#define IOMUX_PINCM16_PF_UC3_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM16_PF_UC1_SDA                      ((uint32_t)0X00000003)
#define IOMUX_PINCM16_PF_UC1_TX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM16_PF_UC1_RTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM16_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM16_PF_TIMG6_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM16_PF_UC2_SCLK                     ((uint32_t)0X00000007)
#define IOMUX_PINCM16_PF_TIMA0_CCP0                   ((uint32_t)0X00000008)

/* IOMUX_PINCM17[PF] Bits */
#define IOMUX_PINCM17_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM17_PF_GPIOB_DIO04                  ((uint32_t)0X00000001)
#define IOMUX_PINCM17_PF_UC1_SDA                      ((uint32_t)0X00000002)
#define IOMUX_PINCM17_PF_UC1_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM17_PF_UC3_CS0                      ((uint32_t)0X00000003)
#define IOMUX_PINCM17_PF_UC3_CTS                      ((uint32_t)0X00000003)
#define IOMUX_PINCM17_PF_TIMA0_CCP1                   ((uint32_t)0X00000004)
#define IOMUX_PINCM17_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM17_PF_TIMG0_CCP0                   ((uint32_t)0X00000006)

/* IOMUX_PINCM18[PF] Bits */
#define IOMUX_PINCM18_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM18_PF_GPIOB_DIO05                  ((uint32_t)0X00000001)
#define IOMUX_PINCM18_PF_UC1_SCL                      ((uint32_t)0X00000002)
#define IOMUX_PINCM18_PF_UC1_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM18_PF_UC3_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM18_PF_UC3_RTS                      ((uint32_t)0X00000003)
#define IOMUX_PINCM18_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000004)
#define IOMUX_PINCM18_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM18_PF_TIMG0_CCP1                   ((uint32_t)0X00000006)

/* IOMUX_PINCM19[PF] Bits */
#define IOMUX_PINCM19_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM19_PF_GPIOA_DIO08                  ((uint32_t)0X00000001)
#define IOMUX_PINCM19_PF_UC1_SDA                      ((uint32_t)0X00000002)
#define IOMUX_PINCM19_PF_UC1_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM19_PF_UC2_CS0                      ((uint32_t)0X00000003)
#define IOMUX_PINCM19_PF_UC0_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM19_PF_UC0_TX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM19_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM19_PF_TIMA_FAULT2                  ((uint32_t)0X00000006)
#define IOMUX_PINCM19_PF_TIMA_FAULT0                  ((uint32_t)0X00000007)
#define IOMUX_PINCM19_PF_UC2_CS3                      ((uint32_t)0X00000008)
#define IOMUX_PINCM19_PF_I2S0_WCLK                    ((uint32_t)0X00000009)
#define IOMUX_PINCM19_PF_UC0_RTS                      ((uint32_t)0X0000000A)
#define IOMUX_PINCM19_PF_SYSCTL_HFCLKIN               ((uint32_t)0X0000000B)

/* IOMUX_PINCM20[PF] Bits */
#define IOMUX_PINCM20_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM20_PF_GPIOA_DIO09                  ((uint32_t)0X00000001)
#define IOMUX_PINCM20_PF_UC1_SCL                      ((uint32_t)0X00000002)
#define IOMUX_PINCM20_PF_UC1_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM20_PF_UC2_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM20_PF_UC0_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM20_PF_UC0_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM20_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM20_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)
#define IOMUX_PINCM20_PF_TIMA0_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM20_PF_LFSS_RTC_OUT                 ((uint32_t)0X00000008)
#define IOMUX_PINCM20_PF_I2S0_BCLK                    ((uint32_t)0X00000009)
#define IOMUX_PINCM20_PF_UC3_SCLK                     ((uint32_t)0X0000000A)
#define IOMUX_PINCM20_PF_UC3_RX                       ((uint32_t)0X0000000A)
#define IOMUX_PINCM20_PF_UC0_CTS                      ((uint32_t)0X0000000B)

