TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/m0p/mspm0g518x.h
/* IOMUX_PINCM21[PF] Bits */
#define IOMUX_PINCM21_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM21_PF_GPIOA_DIO10                  ((uint32_t)0X00000001)
#define IOMUX_PINCM21_PF_UC0_SDA                      ((uint32_t)0X00000002)
#define IOMUX_PINCM21_PF_UC0_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM21_PF_UC2_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM21_PF_UC1_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM21_PF_UC1_TX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM21_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM21_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)
#define IOMUX_PINCM21_PF_TIMG0_CCP0                   ((uint32_t)0X00000007)
#define IOMUX_PINCM21_PF_TIMA_FAULT1                  ((uint32_t)0X00000008)
#define IOMUX_PINCM21_PF_I2S0_AD0                     ((uint32_t)0X00000009)
#define IOMUX_PINCM21_PF_UC3_PICO                     ((uint32_t)0X0000000A)
#define IOMUX_PINCM21_PF_UC3_TX                       ((uint32_t)0X0000000A)

/* IOMUX_PINCM22[PF] Bits */
#define IOMUX_PINCM22_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM22_PF_GPIOA_DIO11                  ((uint32_t)0X00000001)
#define IOMUX_PINCM22_PF_UC0_SCL                      ((uint32_t)0X00000002)
#define IOMUX_PINCM22_PF_UC0_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM22_PF_UC2_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM22_PF_UC1_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM22_PF_UC1_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM22_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM22_PF_COMP0_OUT                    ((uint32_t)0X00000006)
#define IOMUX_PINCM22_PF_TIMG0_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM22_PF_TIMA_FAULT0                  ((uint32_t)0X00000008)
#define IOMUX_PINCM22_PF_I2S0_AD1                     ((uint32_t)0X00000009)
#define IOMUX_PINCM22_PF_UC3_POCI                     ((uint32_t)0X0000000A)
#define IOMUX_PINCM22_PF_UC3_RTS                      ((uint32_t)0X0000000A)

/* IOMUX_PINCM23[PF] Bits */
#define IOMUX_PINCM23_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM23_PF_GPIOB_DIO06                  ((uint32_t)0X00000001)
#define IOMUX_PINCM23_PF_UC1_SDA                      ((uint32_t)0X00000002)
#define IOMUX_PINCM23_PF_UC1_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM23_PF_UC3_CS0                      ((uint32_t)0X00000003)
#define IOMUX_PINCM23_PF_UC3_CTS                      ((uint32_t)0X00000003)
#define IOMUX_PINCM23_PF_UC2_CS1                      ((uint32_t)0X00000004)
#define IOMUX_PINCM23_PF_TIMG6_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM23_PF_TIMA_FAULT2                  ((uint32_t)0X00000006)

/* IOMUX_PINCM24[PF] Bits */
#define IOMUX_PINCM24_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM24_PF_GPIOB_DIO07                  ((uint32_t)0X00000001)
#define IOMUX_PINCM24_PF_UC1_SCL                      ((uint32_t)0X00000002)
#define IOMUX_PINCM24_PF_UC1_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM24_PF_UC3_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM24_PF_UC3_RTS                      ((uint32_t)0X00000003)
#define IOMUX_PINCM24_PF_UC2_CS2                      ((uint32_t)0X00000004)
#define IOMUX_PINCM24_PF_TIMG6_CCP1                   ((uint32_t)0X00000005)

/* IOMUX_PINCM25[PF] Bits */
#define IOMUX_PINCM25_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM25_PF_GPIOB_DIO08                  ((uint32_t)0X00000001)
#define IOMUX_PINCM25_PF_UC1_CTS                      ((uint32_t)0X00000002)
#define IOMUX_PINCM25_PF_UC3_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM25_PF_UC3_TX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM25_PF_COMP0_OUT                    ((uint32_t)0X00000004)
#define IOMUX_PINCM25_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)

/* IOMUX_PINCM26[PF] Bits */
#define IOMUX_PINCM26_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM26_PF_GPIOB_DIO09                  ((uint32_t)0X00000001)
#define IOMUX_PINCM26_PF_UC1_RTS                      ((uint32_t)0X00000002)
#define IOMUX_PINCM26_PF_UC3_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM26_PF_UC3_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM26_PF_TIMA0_CCP1                   ((uint32_t)0X00000004)
#define IOMUX_PINCM26_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000005)

/* IOMUX_PINCM27[PF] Bits */
#define IOMUX_PINCM27_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM27_PF_GPIOB_DIO10                  ((uint32_t)0X00000001)
#define IOMUX_PINCM27_PF_UC3_CS0                      ((uint32_t)0X00000002)
#define IOMUX_PINCM27_PF_UC3_CTS                      ((uint32_t)0X00000002)
#define IOMUX_PINCM27_PF_UC2_CS1                      ((uint32_t)0X00000003)
#define IOMUX_PINCM27_PF_COMP0_OUT                    ((uint32_t)0X00000004)
#define IOMUX_PINCM27_PF_TIMG0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM27_PF_TIMG6_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM27_PF_I2S0_WCLK                    ((uint32_t)0X00000007)

/* IOMUX_PINCM28[PF] Bits */
#define IOMUX_PINCM28_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM28_PF_GPIOB_DIO11                  ((uint32_t)0X00000001)
#define IOMUX_PINCM28_PF_UC3_POCI                     ((uint32_t)0X00000002)
#define IOMUX_PINCM28_PF_UC3_RTS                      ((uint32_t)0X00000002)
#define IOMUX_PINCM28_PF_UC2_CS2                      ((uint32_t)0X00000003)
#define IOMUX_PINCM28_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000004)
#define IOMUX_PINCM28_PF_TIMG0_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM28_PF_TIMG6_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM28_PF_I2S0_BCLK                    ((uint32_t)0X00000007)

/* IOMUX_PINCM29[PF] Bits */
#define IOMUX_PINCM29_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM29_PF_GPIOB_DIO12                  ((uint32_t)0X00000001)
#define IOMUX_PINCM29_PF_UC3_PICO                     ((uint32_t)0X00000002)
#define IOMUX_PINCM29_PF_UC3_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM29_PF_UC2_CS0                      ((uint32_t)0X00000003)
#define IOMUX_PINCM29_PF_TIMA_FAULT1                  ((uint32_t)0X00000004)
#define IOMUX_PINCM29_PF_TIMA0_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM29_PF_TIMA0_CCP2                   ((uint32_t)0X00000006)
#define IOMUX_PINCM29_PF_I2S0_AD0                     ((uint32_t)0X00000007)

/* IOMUX_PINCM30[PF] Bits */
#define IOMUX_PINCM30_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM30_PF_GPIOB_DIO13                  ((uint32_t)0X00000001)
#define IOMUX_PINCM30_PF_UC3_SCLK                     ((uint32_t)0X00000002)
#define IOMUX_PINCM30_PF_UC3_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM30_PF_UC3_CS0                      ((uint32_t)0X00000003)
#define IOMUX_PINCM30_PF_UC3_CTS                      ((uint32_t)0X00000003)
#define IOMUX_PINCM30_PF_TIMA_FAULT2                  ((uint32_t)0X00000004)
#define IOMUX_PINCM30_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM30_PF_TIMA0_CCP3                   ((uint32_t)0X00000006)
#define IOMUX_PINCM30_PF_I2S0_AD1                     ((uint32_t)0X00000007)

/* IOMUX_PINCM31[PF] Bits */
#define IOMUX_PINCM31_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM31_PF_GPIOB_DIO14                  ((uint32_t)0X00000001)
#define IOMUX_PINCM31_PF_UC2_CS3                      ((uint32_t)0X00000002)
#define IOMUX_PINCM31_PF_UC3_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM31_PF_UC3_RTS                      ((uint32_t)0X00000003)
#define IOMUX_PINCM31_PF_TIMA0_CCP2                   ((uint32_t)0X00000004)
#define IOMUX_PINCM31_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM31_PF_I2S0_MCLK                    ((uint32_t)0X00000007)

