TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/m0p/mspm0g518x.h
/* IOMUX_PINCM42[PF] Bits */
#define IOMUX_PINCM42_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM42_PF_GPIOA_DIO20                  ((uint32_t)0X00000001)
#define IOMUX_PINCM42_PF_DEBUGSS_SWCLK                ((uint32_t)0X00000002)
#define IOMUX_PINCM42_PF_UC3_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM42_PF_UC3_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM42_PF_UC1_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM42_PF_UC1_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM42_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM42_PF_TIMG0_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM42_PF_UC3_CS0                      ((uint32_t)0X00000007)
#define IOMUX_PINCM42_PF_UC3_CTS                      ((uint32_t)0X00000007)
#define IOMUX_PINCM42_PF_I2S0_AD1                     ((uint32_t)0X00000008)

/* IOMUX_PINCM43[PF] Bits */
#define IOMUX_PINCM43_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM43_PF_GPIOB_DIO17                  ((uint32_t)0X00000001)
#define IOMUX_PINCM43_PF_UC0_SCL                      ((uint32_t)0X00000002)
#define IOMUX_PINCM43_PF_UC0_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM43_PF_UC2_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM43_PF_TIMG0_CCP0                   ((uint32_t)0X00000004)
#define IOMUX_PINCM43_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)

/* IOMUX_PINCM44[PF] Bits */
#define IOMUX_PINCM44_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM44_PF_GPIOB_DIO18                  ((uint32_t)0X00000001)
#define IOMUX_PINCM44_PF_UC0_SDA                      ((uint32_t)0X00000002)
#define IOMUX_PINCM44_PF_UC0_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM44_PF_UC2_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM44_PF_TIMG0_CCP1                   ((uint32_t)0X00000004)
#define IOMUX_PINCM44_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)

/* IOMUX_PINCM45[PF] Bits */
#define IOMUX_PINCM45_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM45_PF_GPIOB_DIO19                  ((uint32_t)0X00000001)
#define IOMUX_PINCM45_PF_UC0_CTS                      ((uint32_t)0X00000002)
#define IOMUX_PINCM45_PF_UC2_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM45_PF_TIMG7_CCP1                   ((uint32_t)0X00000004)
#define IOMUX_PINCM45_PF_COMP0_OUT                    ((uint32_t)0X00000005)

/* IOMUX_PINCM46[PF] Bits */
#define IOMUX_PINCM46_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM46_PF_GPIOA_DIO21                  ((uint32_t)0X00000001)
#define IOMUX_PINCM46_PF_UC3_PICO                     ((uint32_t)0X00000002)
#define IOMUX_PINCM46_PF_UC3_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM46_PF_UC2_CS3                      ((uint32_t)0X00000003)
#define IOMUX_PINCM46_PF_UC1_CTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM46_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM46_PF_TIMG6_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM46_PF_COMP0_OUT                    ((uint32_t)0X00000007)
#define IOMUX_PINCM46_PF_I2S0_AD0                     ((uint32_t)0X00000008)

/* IOMUX_PINCM47[PF] Bits */
#define IOMUX_PINCM47_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM47_PF_GPIOA_DIO22                  ((uint32_t)0X00000001)
#define IOMUX_PINCM47_PF_UC3_SCLK                     ((uint32_t)0X00000002)
#define IOMUX_PINCM47_PF_UC3_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM47_PF_UC2_CS2                      ((uint32_t)0X00000003)
#define IOMUX_PINCM47_PF_UC1_RTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM47_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM47_PF_TIMG6_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM47_PF_TIMA0_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM47_PF_I2S0_BCLK                    ((uint32_t)0X00000008)
#define IOMUX_PINCM47_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000009)

/* IOMUX_PINCM48[PF] Bits */
#define IOMUX_PINCM48_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM48_PF_GPIOB_DIO20                  ((uint32_t)0X00000001)
#define IOMUX_PINCM48_PF_UC0_SDA                      ((uint32_t)0X00000002)
#define IOMUX_PINCM48_PF_UC0_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM48_PF_UC3_CS0                      ((uint32_t)0X00000003)
#define IOMUX_PINCM48_PF_UC3_CTS                      ((uint32_t)0X00000003)
#define IOMUX_PINCM48_PF_UC2_CS2                      ((uint32_t)0X00000004)
#define IOMUX_PINCM48_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM48_PF_TIMA_FAULT1                  ((uint32_t)0X00000006)
#define IOMUX_PINCM48_PF_TIMA0_CCP1                   ((uint32_t)0X00000007)

/* IOMUX_PINCM49[PF] Bits */
#define IOMUX_PINCM49_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM49_PF_GPIOB_DIO21                  ((uint32_t)0X00000001)
#define IOMUX_PINCM49_PF_UC0_SCL                      ((uint32_t)0X00000002)
#define IOMUX_PINCM49_PF_UC0_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM49_PF_UC3_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM49_PF_UC3_RTS                      ((uint32_t)0X00000003)
#define IOMUX_PINCM49_PF_UC1_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM49_PF_UC1_TX                       ((uint32_t)0X00000004)

/* IOMUX_PINCM50[PF] Bits */
#define IOMUX_PINCM50_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM50_PF_GPIOB_DIO22                  ((uint32_t)0X00000001)
#define IOMUX_PINCM50_PF_UC0_SDA                      ((uint32_t)0X00000002)
#define IOMUX_PINCM50_PF_UC0_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM50_PF_UC3_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM50_PF_UC3_TX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM50_PF_UC1_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM50_PF_UC1_RX                       ((uint32_t)0X00000004)

